# ShowLayer

## Description
Procedure ShowLayer sets the visibility status of the active layer to visible. Newly created layers always defaulted to the Show mode.&lt;BR&gt;

```pascal
PROCEDURE ShowLayer;
```

```python

def vs.ShowLayer():
    return None
```

## Examples
```pascal
Layer('Future Construction');

ShowLayer;

```

## Version
Availability: from MiniCAD
## Category
* Layers